print(1 + 2 + 3 + 4 + 5)
print('홍길동')
print("a" * 20)  # a를 20번 표시
print(2 ** 3)   # 2의 3승
print()
a = 1
b = 2
print(a + b)

# 파이참은 저장 기능 따로 없음 (자동 저장)
# 실행 : ctrl + shift + f10

"""
    ==> 여러줄 주석!
"""

"""
    print() : 소괄호 내부의 데이터를 console에 출력하는 명령어
        ** console : cmd나 terminal 등의 명령 프롬프트
    
    
    < 자료형 (data type) >
    컴퓨터가 처리하는 데이터들의 형태
    1. int(정수) : 소숫점 없는 숫자
    2. float(실수) : 소숫점 있는 숫자
    3. str(문자) : 따옴표(', ") 로 감싼 데이터
                ==> 단어나 문장 등의 데이터는 반드시 따옴표로 감싸야한다!
                    안그러면 에러남 (변수로 인식함)
    4. bool : 참/거짓형
              True, False 두 가지 데이터를 의미한다.
"""

print("ABC" + "DEF")

print("ABC" + "10")

# "10" 과 10 은 다른 데이터다!
print("10" * 5)  # 1010101010
print(10 * 5)  # 50










